## __MySQL Connector & Alchemy__

In [1]:
import mysql.connector
import sqlalchemy as db
import pandas as pd
import numpy as np

## __MySQLConnector__

In [2]:
#buat koneksi agar bisa masuk ke Database
con = mysql.connector.connect(
    host='localhost',
    user='root',
    passwd='Dirumah1'
)

In [3]:
con

## __Show Tables__

In [4]:
c = con.cursor(buffered=True)
query = 'SHOW databases'
c.execute(query)

In [5]:
c.fetchall() #menampilkan hasil executenya

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sql_hr',),
 ('sql_inventory',),
 ('sql_invoicing',),
 ('sql_store',),
 ('sys',)]

In [6]:
query = 'USE sql_store'
c.execute(query)
#untum USE sql_store tidak bisa di panggil menggunakan fetchall, karna itu quary di atas hanya untuk memilih databases

In [7]:
query = 'SHOW tables'
c.execute(query)
c.fetchall()

[('customers',),
 ('order_item_notes',),
 ('order_items',),
 ('order_statuses',),
 ('orders',),
 ('products',),
 ('shippers',)]

In [8]:
#Cara Bikin Data Frame menggunakan .DataFrame, untuk manipulasi lebih enak menggunakan .DataFrame
#meng input data bisa pake syntax yang di bawah ini
# -- query = 'INSERT INTO [Table] [Data] [Value]'
query = 'SELECT * FROM customers'
c.execute(query)
res = c.fetchall()
cols = c.column_names

# bikin DF
customer_df = pd.DataFrame(res, columns = cols)
customer_df.set_index('customer_id', inplace=True)
customer_df

,first_name,last_name,birth_date,phone,address,city,state,points
customer_id,,,,,,,,
1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
2,Ines,Brushfield,1986-04-13,804-427-9456,14187 Commercial Trail,Hampton,VA,947
3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
4,Ambur,Roseburgh,1974-04-14,407-231-8017,30 Arapahoe Terrace,Orlando,FL,457
5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
10,Levy,Mynett,1969-10-13,404-246-3370,68 Lawn Avenue,Atlanta,GA,796
11,Robert,Pattionson,1992-02-29,404-234-2222,255 Avenue,Los Angeles,LA,0
12,Andy,Warholl,1991-03-29,404-234-5322,245 Avenue,Atlanta,GA,0
13,Buzz,Lightyear,1990-03-15,404-234-5367,045 Avenue,Visalia,ca,0
14,woody,Fish,1994-01-01,404-784-5367,005 Avenue,Visalia,ca,0
15,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
16,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0

In [9]:
cols

('customer_id',
 'first_name',
 'last_name',
 'birth_date',
 'phone',
 'address',
 'city',
 'state',
 'points')

In [10]:
cust_df = pd.read_sql('select * from customers', con, parse_dates='birth_date')

#parse_dates mengubah data typenya menjadi date time

In [11]:
cust_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  16 non-null     int64
 1   first_name   16 non-null     object
 2   last_name    16 non-null     object
 3   birth_date   16 non-null     datetime64[ns]
 4   phone        13 non-null     object
 5   address      16 non-null     object
 6   city         16 non-null     object
 7   state        16 non-null     object
 8   points       16 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(6)
memory usage: 1.2+ KB

In [12]:
#Memanggil dataframenya juga bisa menggunakan cara seperti ini.

q = 'INSERT INTO customers(first_name, last_name, birth_date, address, city, state, points) values(%s, %s, %s,%s, %s, %s, %s)'
data = ('Andy','Budiman','1991-08-17','Jl.Mawar','Jakarta','DK',0)
c.execute(q, data)

In [13]:
con.commit() #Meng comit perubahan yang ada, dan harus di commit setiap habis membuat query

In [14]:
pd.read_sql('select * from customers', con)

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
1,2,Ines,Brushfield,1986-04-13,804-427-9456,14187 Commercial Trail,Hampton,VA,947
2,3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
3,4,Ambur,Roseburgh,1974-04-14,407-231-8017,30 Arapahoe Terrace,Orlando,FL,457
4,5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
5,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
6,7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
7,8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
8,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
9,10,Levy,Mynett,1969-10-13,404-246-3370,68 Lawn Avenue,Atlanta,GA,796
10,11,Robert,Pattionson,1992-02-29,404-234-2222,255 Avenue,Los Angeles,LA,0
11,12,Andy,Warholl,1991-03-29,404-234-5322,245 Avenue,Atlanta,GA,0
12,13,Buzz,Lightyear,1990-03-15,404-234-5367,045 Avenue,Visalia,ca,0
13,14,woody,Fish,1994-01-01,404-784-5367,005 Avenue,Visalia,ca,0
14,15,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
15,16,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0
16,20,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0

In [15]:
q = 'INSERT INTO customers(first_name, last_name, birth_date, address, city, state, points) values(%s, %s, %s,%s, %s, %s, %s)'
data = ('Tio','Sableng','1991-05-27','Jl.Mawar VI','Jakarta','DK',0)
c.execute(q, data)

#di sini ga harus pake (%S) tidak apa apa dan bisa langsung seperti di bawah ini
#q = 'INSERT INTO customers(first_name, last_name, birth_date, address, city, state, points) values('Tio','Sableng','1991-05-27','Jl.Mawar VI','Jakarta','DK',0)'

In [16]:
query = 'SELECT * FROM customers'
c.execute(query)
res = c.fetchall()
cols = c.column_names

# bikin DF
customer_df = pd.DataFrame(res, columns = cols)
customer_df.set_index('customer_id', inplace=True)
customer_df

,first_name,last_name,birth_date,phone,address,city,state,points
customer_id,,,,,,,,
1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
2,Ines,Brushfield,1986-04-13,804-427-9456,14187 Commercial Trail,Hampton,VA,947
3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
4,Ambur,Roseburgh,1974-04-14,407-231-8017,30 Arapahoe Terrace,Orlando,FL,457
5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
10,Levy,Mynett,1969-10-13,404-246-3370,68 Lawn Avenue,Atlanta,GA,796
11,Robert,Pattionson,1992-02-29,404-234-2222,255 Avenue,Los Angeles,LA,0
12,Andy,Warholl,1991-03-29,404-234-5322,245 Avenue,Atlanta,GA,0
13,Buzz,Lightyear,1990-03-15,404-234-5367,045 Avenue,Visalia,ca,0
14,woody,Fish,1994-01-01,404-784-5367,005 Avenue,Visalia,ca,0
15,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
16,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0
20,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
21,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0

In [17]:
customer_df.to_csv('Customer.csv')

## _Delet Row_

In [18]:
q = 'delete from customers where customer_id in (19)'
c.execute(q)

In [19]:
c.execute(query)
res = c.fetchall()
cols = c.column_names

# bikin DF
customer_df = pd.DataFrame(res, columns = cols)
customer_df.set_index('customer_id', inplace=True)
customer_df

,first_name,last_name,birth_date,phone,address,city,state,points
customer_id,,,,,,,,
1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
2,Ines,Brushfield,1986-04-13,804-427-9456,14187 Commercial Trail,Hampton,VA,947
3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
4,Ambur,Roseburgh,1974-04-14,407-231-8017,30 Arapahoe Terrace,Orlando,FL,457
5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
10,Levy,Mynett,1969-10-13,404-246-3370,68 Lawn Avenue,Atlanta,GA,796
11,Robert,Pattionson,1992-02-29,404-234-2222,255 Avenue,Los Angeles,LA,0
12,Andy,Warholl,1991-03-29,404-234-5322,245 Avenue,Atlanta,GA,0
13,Buzz,Lightyear,1990-03-15,404-234-5367,045 Avenue,Visalia,ca,0
14,woody,Fish,1994-01-01,404-784-5367,005 Avenue,Visalia,ca,0
15,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
16,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0
20,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
21,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0

## _Update ROW_

In [20]:
q = "update customers set first_name= 'woody' where customer_id = 14"
c.execute(q)

In [21]:
query = 'SELECT * FROM customers'
c.execute(query)
res = c.fetchall()
cols = c.column_names

# bikin DF
customer_df = pd.DataFrame(res, columns = cols)
customer_df.set_index('customer_id', inplace=True)
customer_df

,first_name,last_name,birth_date,phone,address,city,state,points
customer_id,,,,,,,,
1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
2,Ines,Brushfield,1986-04-13,804-427-9456,14187 Commercial Trail,Hampton,VA,947
3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
4,Ambur,Roseburgh,1974-04-14,407-231-8017,30 Arapahoe Terrace,Orlando,FL,457
5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
10,Levy,Mynett,1969-10-13,404-246-3370,68 Lawn Avenue,Atlanta,GA,796
11,Robert,Pattionson,1992-02-29,404-234-2222,255 Avenue,Los Angeles,LA,0
12,Andy,Warholl,1991-03-29,404-234-5322,245 Avenue,Atlanta,GA,0
13,Buzz,Lightyear,1990-03-15,404-234-5367,045 Avenue,Visalia,ca,0
14,woody,Fish,1994-01-01,404-784-5367,005 Avenue,Visalia,ca,0
15,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
16,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0
20,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
21,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0

In [22]:
con.commit()

In [23]:
#con.close (untung memutus koneksi dari database)

## SQLAlchemy

In [24]:
import sqlalchemy as db

In [25]:
#buat koneksinya dulu

engine1 = db.create_engine('mysql+pymysql://root:Dirumah1@localhost:3306/sql_store')
con1 = engine1.connect()
meta = db.MetaData()

In [26]:
pd.read_sql('SELECT * FROM customers', con1, index_col='customer_id')

,first_name,last_name,birth_date,phone,address,city,state,points
customer_id,,,,,,,,
1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
2,Ines,Brushfield,1986-04-13,804-427-9456,14187 Commercial Trail,Hampton,VA,947
3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
4,Ambur,Roseburgh,1974-04-14,407-231-8017,30 Arapahoe Terrace,Orlando,FL,457
5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
10,Levy,Mynett,1969-10-13,404-246-3370,68 Lawn Avenue,Atlanta,GA,796
11,Robert,Pattionson,1992-02-29,404-234-2222,255 Avenue,Los Angeles,LA,0
12,Andy,Warholl,1991-03-29,404-234-5322,245 Avenue,Atlanta,GA,0
13,Buzz,Lightyear,1990-03-15,404-234-5367,045 Avenue,Visalia,ca,0
14,woody,Fish,1994-01-01,404-784-5367,005 Avenue,Visalia,ca,0
15,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
16,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0
20,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
21,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0

## Viewing Table Details
SQLAlchemy dan be used to automatically load tables from a database using something called reflection. Reflection is the process of reading the database and building the metadata based on thah information

In [27]:
cust = db.Table('customers', meta, autoload=True, autoload_with=engine1)
cust

Table('customers', MetaData(bind=None), Column('customer_id', INTEGER(), table=<customers>, primary_key=True, nullable=False), Column('first_name', VARCHAR(length=50), table=<customers>, nullable=False), Column('last_name', VARCHAR(length=50), table=<customers>, nullable=False), Column('birth_date', DATE(), table=<customers>), Column('phone', VARCHAR(length=50), table=<customers>), Column('address', VARCHAR(length=50), table=<customers>, nullable=False), Column('city', VARCHAR(length=50), table=<customers>, nullable=False), Column('state', CHAR(length=2), table=<customers>, nullable=False), Column('points', INTEGER(), table=<customers>, nullable=False, server_default=DefaultClause(<sqlalchemy.sql.elements.TextClause object at 0x000001B64A332C10>, for_update=False)), schema=None)

In [28]:
cust.columns.keys()

['customer_id',
 'first_name',
 'last_name',
 'birth_date',
 'phone',
 'address',
 'city',
 'state',
 'points']

## _Querying (Using Meta Data)_
### _SELECT ALL_

In [29]:
query = db.select([cust])
result_set = con1.execute(query).fetchall()
result_set

[(1, 'Babara', 'MacCaffrey', datetime.date(1986, 3, 28), '781-932-9754', '0 Sage Terrace', 'Waltham', 'MA', 2273),
 (2, 'Ines', 'Brushfield', datetime.date(1986, 4, 13), '804-427-9456', '14187 Commercial Trail', 'Hampton', 'VA', 947),
 (3, 'Freddi', 'Boagey', datetime.date(1985, 2, 7), '719-724-7869', '251 Springs Junction', 'Colorado Springs', 'CO', 2967),
 (4, 'Ambur', 'Roseburgh', datetime.date(1974, 4, 14), '407-231-8017', '30 Arapahoe Terrace', 'Orlando', 'FL', 457),
 (5, 'Clemmie', 'Betchley', datetime.date(1973, 11, 7), None, '5 Spohn Circle', 'Arlington', 'TX', 3675),
 (6, 'Elka', 'Twiddell', datetime.date(1991, 9, 4), '312-480-8498', '7 Manley Drive', 'Chicago', 'IL', 3073),
 (7, 'Ilene', 'Dowson', datetime.date(1964, 8, 30), '615-641-4759', '50 Lillian Crossing', 'Nashville', 'TN', 1672),
 (8, 'Thacher', 'Naseby', datetime.date(1993, 7, 17), '941-527-3977', '538 Mosinee Center', 'Sarasota', 'FL', 205),
 (9, 'Romola', 'Rumgay', datetime.date(1992, 5, 23), '559-181-3744', '3520 Ohio Trail', 'Visalia', 'CA', 1486),
 (10, 'Levy', 'Mynett', datetime.date(1969, 10, 13), '404-246-3370', '68 Lawn Avenue', 'Atlanta', 'GA', 796),
 (11, 'Robert', 'Pattionson', datetime.date(1992, 2, 29), '404-234-2222', '255 Avenue', 'Los Angeles', 'LA', 0),
 (12, 'Andy', 'Warholl', datetime.date(1991, 3, 29), '404-234-5322', '245 Avenue', 'Atlanta', 'GA', 0),
 (13, 'Buzz', 'Lightyear', datetime.date(1990, 3, 15), '404-234-5367', '045 Avenue', 'Visalia', 'ca', 0),
 (14, 'woody', 'Fish', datetime.date(1994, 1, 1), '404-784-5367', '005 Avenue', 'Visalia', 'ca', 0),
 (15, 'Andy', 'Budiman', datetime.date(1991, 8, 17), None, 'Jl.Mawar', 'Jakarta', 'DK', 0),
 (16, 'Tio', 'Sableng', datetime.date(1991, 5, 27), None, 'Jl.Mawar VI', 'Jakarta', 'DK', 0),
 (20, 'Andy', 'Budiman', datetime.date(1991, 8, 17), None, 'Jl.Mawar', 'Jakarta', 'DK', 0),
 (21, 'Tio', 'Sableng', datetime.date(1991, 5, 27), None, 'Jl.Mawar VI', 'Jakarta', 'DK', 0)]

In [30]:
df_cust = pd.DataFrame(result_set, columns = cust.c.keys())
df_cust

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
1,2,Ines,Brushfield,1986-04-13,804-427-9456,14187 Commercial Trail,Hampton,VA,947
2,3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
3,4,Ambur,Roseburgh,1974-04-14,407-231-8017,30 Arapahoe Terrace,Orlando,FL,457
4,5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
5,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
6,7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
7,8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
8,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
9,10,Levy,Mynett,1969-10-13,404-246-3370,68 Lawn Avenue,Atlanta,GA,796
10,11,Robert,Pattionson,1992-02-29,404-234-2222,255 Avenue,Los Angeles,LA,0
11,12,Andy,Warholl,1991-03-29,404-234-5322,245 Avenue,Atlanta,GA,0
12,13,Buzz,Lightyear,1990-03-15,404-234-5367,045 Avenue,Visalia,ca,0
13,14,woody,Fish,1994-01-01,404-784-5367,005 Avenue,Visalia,ca,0
14,15,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
15,16,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0
16,20,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
17,21,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0

## WHERE

In [31]:
'''
SQL :
SELECT * FROM customers WHERE points >= 1000

'''

query = db.select([cust]).where(cust.columns.points>= 1000)
result_set = con1.execute(query).fetchall()
points_1000 = pd.DataFrame(result_set, columns=cust.c.keys())
points_1000

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
1,3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
2,5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
3,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
4,7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
5,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486

In [32]:
pd.read_sql('SELECT * FROM customers WHERE points >= 1000', con1)

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
1,3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
2,5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
3,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
4,7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
5,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486

## IN

In [33]:
'''
SELECT * FROM customers WHRE state in ('VA','FL','GA')
'''

query = db.select([cust]).where(cust.c.state.in_(['VL','FL','GA']))
df_vaflga = pd.DataFrame(result_set, columns=cust.c.keys())
df_vaflga

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
1,3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
2,5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
3,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
4,7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
5,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486

In [34]:
pd.read_sql("SELECT * FROM customers WHERE state IN ('VA','FL','GA')", con1)

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,2,Ines,Brushfield,1986-04-13,804-427-9456,14187 Commercial Trail,Hampton,VA,947
1,4,Ambur,Roseburgh,1974-04-14,407-231-8017,30 Arapahoe Terrace,Orlando,FL,457
2,8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
3,10,Levy,Mynett,1969-10-13,404-246-3370,68 Lawn Avenue,Atlanta,GA,796
4,12,Andy,Warholl,1991-03-29,404-234-5322,245 Avenue,Atlanta,GA,0

## AND OR

In [35]:
'''
SELECT * FROM customers WHRE birth_date > '1990-01-01' AND points >1000
'''

query = db.select([cust]).where(db.and_(cust.c.birth_date > '1990-01-01', cust.c.points > 1000))
result_set = con1.execute(query).fetchall()
result_set

[(6, 'Elka', 'Twiddell', datetime.date(1991, 9, 4), '312-480-8498', '7 Manley Drive', 'Chicago', 'IL', 3073),
 (9, 'Romola', 'Rumgay', datetime.date(1992, 5, 23), '559-181-3744', '3520 Ohio Trail', 'Visalia', 'CA', 1486)]

In [36]:
birth_90 = pd.DataFrame(result_set, columns=cust.c.keys())
birth_90

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
1,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486

In [37]:
pd.read_sql("select * \
FROM customers \
WHERE birth_date > '1990-01-01' AND points > 1000", con1)

# tanda garis \ (miring kiri) itu untuk menurunkan query sehingga masih dalam 1 query

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
1,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486

In [38]:
'''
SELECT *
FROM customers
WHERE birth_date > '1990-01-01' OR points > 1000
AND state='VA'
'''

query = db.select([cust]).where(db.or_(cust.c.birth_date > '1990-01-01',db.and_(cust.c.points>1000, cust.c.state=='VA')))
result_set = con1.execute(query).fetchall()
birth_90_df = pd.DataFrame(result_set, columns=cust.c.keys())
birth_90_df

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
1,8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
2,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
3,11,Robert,Pattionson,1992-02-29,404-234-2222,255 Avenue,Los Angeles,LA,0
4,12,Andy,Warholl,1991-03-29,404-234-5322,245 Avenue,Atlanta,GA,0
5,13,Buzz,Lightyear,1990-03-15,404-234-5367,045 Avenue,Visalia,ca,0
6,14,woody,Fish,1994-01-01,404-784-5367,005 Avenue,Visalia,ca,0
7,15,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
8,16,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0
9,20,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
10,21,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0

In [39]:
pd.read_sql("SELECT * \
FROM customers \
WHERE birth_date > '1990-01-01' OR points > 1000 \
AND state='VA'", con1)

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
1,8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
2,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
3,11,Robert,Pattionson,1992-02-29,404-234-2222,255 Avenue,Los Angeles,LA,0
4,12,Andy,Warholl,1991-03-29,404-234-5322,245 Avenue,Atlanta,GA,0
5,13,Buzz,Lightyear,1990-03-15,404-234-5367,045 Avenue,Visalia,ca,0
6,14,woody,Fish,1994-01-01,404-784-5367,005 Avenue,Visalia,ca,0
7,15,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
8,16,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0
9,20,Andy,Budiman,1991-08-17,None,Jl.Mawar,Jakarta,DK,0
10,21,Tio,Sableng,1991-05-27,None,Jl.Mawar VI,Jakarta,DK,0

## BETWEEN

In [40]:
'''
Select customer_id, first_name, last_name, points
FROM customers 
WHERE points BETWEEN 1000 and 3000
'''

query = db.select([cust.c.customer_id, cust.c.first_name, cust.c.last_name, cust.c.points]).where(db.between(cust.c.points, lower_bound = 1000, upper_bound = 3000))
result_set = con1.execute(query).fetchall()
df_points = pd.DataFrame (result_set, columns= result_set[0].keys())
df_points

   customer_id first_name   last_name  points
0            1     Babara  MacCaffrey    2273
1            3     Freddi      Boagey    2967
2            7      Ilene      Dowson    1672
3            9     Romola      Rumgay    1486

In [41]:
pd.read_sql("Select customer_id, first_name, last_name, points FROM customers WHERE points BETWEEN 1000 and 3000", con1)

   customer_id first_name   last_name  points
0            1     Babara  MacCaffrey    2273
1            3     Freddi      Boagey    2967
2            7      Ilene      Dowson    1672
3            9     Romola      Rumgay    1486

## __JOIN__

In [42]:
'''
SELECT order_id, c.customer_id, first_name, last_name
FROM orders o 
JOIN customers c
ON o.customer_ID = c.customer_id
'''
orders = db.Table('orders', meta, autoload=True, autoload_with=engine1)

In [43]:
orders

Table('orders', MetaData(bind=None), Column('order_id', INTEGER(), table=<orders>, primary_key=True, nullable=False), Column('customer_id', INTEGER(), ForeignKey('customers.customer_id'), table=<orders>, nullable=False), Column('order_date', DATE(), table=<orders>, nullable=False), Column('status', TINYINT(), ForeignKey('order_statuses.order_status_id'), table=<orders>, nullable=False, server_default=DefaultClause(<sqlalchemy.sql.elements.TextClause object at 0x000001B64A5428B0>, for_update=False)), Column('comments', VARCHAR(length=2000), table=<orders>), Column('shipped_date', DATE(), table=<orders>), Column('shipper_id', SMALLINT(), ForeignKey('shippers.shipper_id'), table=<orders>), schema=None)

In [44]:
query1 = db.select([orders.c.order_id, cust.c.customer_id, cust.c.first_name, cust.c.last_name])
query2 = query1.select_from(cust.join(orders, cust.c.customer_id == orders.c.customer_id))

result_set = con1.execute(query2).fetchall()
df_cust_order = pd.DataFrame(result_set, columns=result_set[0].keys())
df_cust_order

    order_id  customer_id first_name   last_name
0         11            1     Babara  MacCaffrey
1          4            2       Ines  Brushfield
2          7            2       Ines  Brushfield
3          5            5    Clemmie    Betchley
4          8            5    Clemmie    Betchley
5          1            6       Elka    Twiddell
6         10            6       Elka    Twiddell
7          2            7      Ilene      Dowson
8          3            8    Thacher      Naseby
9          6           10       Levy      Mynett
10         9           10       Levy      Mynett

In [45]:
pd.read_sql("SELECT order_id, c.customer_id, first_name, last_name FROM orders o JOIN customers c ON o.customer_ID = c.customer_id", con1)

    order_id  customer_id first_name   last_name
0         11            1     Babara  MacCaffrey
1          4            2       Ines  Brushfield
2          7            2       Ines  Brushfield
3          5            5    Clemmie    Betchley
4          8            5    Clemmie    Betchley
5          1            6       Elka    Twiddell
6         10            6       Elka    Twiddell
7          2            7      Ilene      Dowson
8          3            8    Thacher      Naseby
9          6           10       Levy      Mynett
10         9           10       Levy      Mynett